nxp-mcuxpresso/mcuxsdk-examples/_boards/lpcxpresso804/common/pin_mux/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: LPC804
package_id: LPC804M101JDH24
mcu_data: ksdk2_0
processor_version: 0.15.6
board: LPCXpresso804
expansion_headers:
- id: single_row_arduino_half_rotated
  name: Arduino Header
  connectors:
  - id: C1
    name: CN4
    pins:
    - {id: 3, pin_num: '6', pin_signal: RESETN/PIO0_5}
    - {id: 4, name: 3.3V, external_signal_types: power_supply_3.3V}
    - {id: 5, name: 5V, external_signal_types: power_supply_5V}
    - {id: 6, name: GND, external_signal_types: ground}
    - {id: 7, name: GND, external_signal_types: ground}
  - id: C2
    name: CN3
    pins:
    - {id: 1, name: D15, pin_num: '23', pin_signal: PIO0_14/ACMP_I3/ADC_2}
    - {id: 2, name: D14, pin_num: '20', pin_signal: PIO0_7/ADC_1/ACMPVREF}
    - {id: 3, name: AREF, external_signal_types: aref}
    - {id: 4, name: GND, external_signal_types: ground}
    - {id: 5, name: D13, pin_num: '15', pin_signal: PIO0_1/ADC_0/ACMP_I2/CLKIN}
    - {id: 6, name: D12, pin_num: '16', pin_signal: PIO0_9/ADC_4}
    - {id: 7, name: D11, pin_num: '17', pin_signal: PIO0_8/ADC_5}
    - {id: 8, name: D10, pin_num: '14', pin_signal: PIO0_15/ADC_8}
    - {id: 9, name: D9, pin_num: '1', pin_signal: PIO0_18}
    - {id: 10, name: D8, pin_num: '13', pin_signal: PIO0_20}
  - id: C3
    name: CN8
    pins:
    - {id: 2, name: D6, pin_num: '24', pin_signal: PIO0_19/DACOUT}
    - {id: 3, name: D5, pin_num: '10', pin_signal: PIO0_11/ADC_6/WKTCLKIN}
    - {id: 4, name: D4, pin_num: '4', pin_signal: PIO0_13/ADC_10}
    - {id: 5, name: D3, pin_num: '12', pin_signal: PIO0_21/ACMP_I5}
    - {id: 6, name: D2, pin_num: '5', pin_signal: PIO0_12}
    - {id: 7, name: D1, pin_num: '7', pin_signal: PIO0_4/ADC_11}
    - {id: 8, name: D0, pin_num: '22', pin_signal: PIO0_0/ACMP_I1}
  - id: C4
    name: CN5
    pins:
    - {id: 1, name: A0, pin_num: '11', pin_signal: PIO0_10/ADC_7}
    - {id: 2, name: A1, pin_num: '2', pin_signal: PIO0_16/ACMP_I4/ADC_3}
    - {id: 3, name: A2, pin_num: '3', pin_signal: PIO0_17/ADC_9}
    - {id: 4, name: A3, pin_num: '20', pin_signal: PIO0_7/ADC_1/ACMPVREF}
    - {id: 5, name: A4, pin_num: '7', pin_signal: PIO0_4/ADC_11}
    - {id: 6, name: A5, pin_num: '15', pin_signal: PIO0_1/ADC_0/ACMP_I2/CLKIN}
pin_labels:
- {pin_num: '10', pin_signal: PIO0_11/ADC_6/WKTCLKIN, label: 'CN6[10]/CN8[3]/D4/PIO0_11/M_PIO0_11', identifier: LED_BLUE}
- {pin_num: '5', pin_signal: PIO0_12, label: 'S2/CN8[6]/CN6[5]/D3/M_PIO0_12/PIO0_12', identifier: LED_GREEN;S2}
- {pin_num: '4', pin_signal: PIO0_13/ADC_10, label: 'S1/CN8[4]/CN6[4]/D2/M_PIO0_13/PIO0_13', identifier: LED_RED;S1}
- {pin_num: '22', pin_signal: PIO0_0/ACMP_I1, label: 'CN7[3]/CN8[8]/JP2/PIO0_0', identifier: DEBUG_UART_RX}
- {pin_num: '7', pin_signal: PIO0_4/ADC_11, label: 'CN6[7]/CN8[7]/CN5[5]/JP24/PIO0_4', identifier: DEBUG_UART_TX}
- {pin_num: '9', pin_signal: SWDIO/PIO0_2, label: 'CN6[9]/CN1[2]/U1[17]/SWDIO_PIO0_2', identifier: DEBUG_SWD_SWDIO}
- {pin_num: '8', pin_signal: SWCLK/PIO0_3, label: 'CN6[8]/CN1[4]/U1[16]/SWCLK_PIO0_3', identifier: DEBUG_SWD_SWDCLK}
- {pin_num: '23', pin_signal: PIO0_14/ACMP_I3/ADC_2, label: 'CN7[2]/CN3[1]/JP4/PIO0_14', identifier: I2C_SCL}
- {pin_num: '20', pin_signal: PIO0_7/ADC_1/ACMPVREF, label: 'CN7[5]/CN3[2]/JP23/CN5[4]/PIO0_7', identifier: I2C_SDA}
- {pin_num: '6', pin_signal: RESETN/PIO0_5, label: 'CN6[6]/CN1[10]/S3/CN4[3]/U1[3]/U1[8]/TRST_P0_5', identifier: DEBUG_SWD_RESETN}
- {pin_num: '1', pin_signal: PIO0_18, label: 'CN6[1]/CN3[9]/PIO0_18'}
- {pin_num: '2', pin_signal: PIO0_16/ACMP_I4/ADC_3, label: 'CN6[2]/CN5[2]/U4[1]/PIO0_16'}
- {pin_num: '3', pin_signal: PIO0_17/ADC_9, label: 'CN6[3]/CN5[3]/PIO0_17'}
- {pin_num: '11', pin_signal: PIO0_10/ADC_7, label: 'CN6[11]/VR1/CN5[1]/PIO0_10'}
- {pin_num: '12', pin_signal: PIO0_21/ACMP_I5, label: 'CN6[12]/CN8[5]/PIO0_21'}
- {pin_num: '13', pin_signal: PIO0_20, label: 'CN7[12]/CN3[10]/PIO0_20'}
- {pin_num: '14', pin_signal: PIO0_15/ADC_8, label: 'CN7[11]/CN3[8]/PIO0_15'}
- {pin_num: '15', pin_signal: PIO0_1/ADC_0/ACMP_I2/CLKIN, label: 'CN7[10]/CN3[5]/CN5[6]/U4[6]/PIO0_1'}
- {pin_num: '16', pin_signal: PIO0_9/ADC_4, label: 'CN7[9]/CN3[6]/R13/U4[2]/PIO0_9/ISP_U0_TXD_DS'}
- {pin_num: '17', pin_signal: PIO0_8/ADC_5, label: 'CN7[8]/CN3[7]/R20/U4[5]/PIO0_8/ISP_U0_RXD_DS'}
- {pin_num: '18', pin_signal: VDD, label: 'CN7[7]/JP5/R37/VDD'}
- {pin_num: '19', pin_signal: VSS, label: GND}
- {pin_num: '21', pin_signal: VREFP, label: 'CN7[4]/JP7/MCU_VREFP'}
- {pin_num: '24', pin_signal: PIO0_19/DACOUT, label: 'CN7[1]/CN8[2]/PIO0_19'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "fsl_swm.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

